In [3]:
import pandas as pd
data={'ID':['A1','A2','A3'],
     'X1':[10,20,30],
     'X2':[1.1,2.2,3.3]}
data

{'ID': ['A1', 'A2', 'A3'], 'X1': [10, 20, 30], 'X2': [1.1, 2.2, 3.3]}

In [8]:
df=pd.DataFrame(data, index=['a1','a2','a3'])
df

    ID  X1   X2
a1  A1  10  1.1
a2  A2  20  2.2
a3  A3  30  3.3

In [10]:
df2=df.reindex(['a1','a2','a3','a4'])
df2

     ID    X1   X2
a1   A1  10.0  1.1
a2   A2  20.0  2.2
a3   A3  30.0  3.3
a4  NaN   NaN  NaN

In [12]:
df2.to_csv("df2.csv", sep=",", na_rep="NaN")
df2

     ID    X1   X2
a1   A1  10.0  1.1
a2   A2  20.0  2.2
a3   A3  30.0  3.3
a4  NaN   NaN  NaN

In [5]:
import numpy as np
df1=pd.DataFrame(data=np.arange(12).reshape(3,4),
                index=['r0','r1','r2'],
                columns=['c0','c1','c2','c3'])
df1

    c0  c1  c2  c3
r0   0   1   2   3
r1   4   5   6   7
r2   8   9  10  11

In [17]:
df1.T

    r0  r1  r2
c0   0   4   8
c1   1   5   9
c2   2   6  10
c3   3   7  11

In [18]:
df1.axes

[Index(['r0', 'r1', 'r2'], dtype='object'),
 Index(['c0', 'c1', 'c2', 'c3'], dtype='object')]

In [19]:
df1.dtypes

c0    int32
c1    int32
c2    int32
c3    int32
dtype: object

In [20]:
df1.info

<bound method DataFrame.info of     c0  c1  c2  c3
r0   0   1   2   3
r1   4   5   6   7
r2   8   9  10  11>

In [21]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, r0 to r2
Data columns (total 4 columns):
c0    3 non-null int32
c1    3 non-null int32
c2    3 non-null int32
c3    3 non-null int32
dtypes: int32(4)
memory usage: 152.0+ bytes

In [22]:
df1.shape

(3, 4)

In [23]:
df1

    c0  c1  c2  c3
r0   0   1   2   3
r1   4   5   6   7
r2   8   9  10  11

In [24]:
type(df1.shape)

tuple

In [25]:
df1.size

12

In [26]:
df1.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [6]:
df2=pd.DataFrame({'c1':['a','a','b','b','c'],
                 'v1':np.arange(5),
                 'v2':np.random.rand(5)
                 },
                index=['r0','r1','r2','r3','r4']
                )
df2

   c1  v1        v2
r0  a   0  0.511970
r1  a   1  0.975210
r2  b   2  0.518890
r3  b   3  0.323018
r4  c   4  0.483577

In [7]:
df2.index

Index(['r0', 'r1', 'r2', 'r3', 'r4'], dtype='object')

In [8]:
df2.ix[2:] 
## 특정행을 지정하게 되는 경우 그 해당 행만 도출되어나옴

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   c1  v1        v2
r2  b   2  0.518890
r3  b   3  0.323018
r4  c   4  0.483577

In [9]:
df2.ix['r2']

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

c1          b
v1          2
v2    0.51889
Name: r2, dtype: object

In [10]:
df2

   c1  v1        v2
r0  a   0  0.511970
r1  a   1  0.975210
r2  b   2  0.518890
r3  b   3  0.323018
r4  c   4  0.483577

In [11]:
df2.head(3)

   c1  v1       v2
r0  a   0  0.51197
r1  a   1  0.97521
r2  b   2  0.51889

In [12]:
df2.tail(4)

   c1  v1        v2
r1  a   1  0.975210
r2  b   2  0.518890
r3  b   3  0.323018
r4  c   4  0.483577

In [13]:
df2.columns 
# 칼럼들에 대한 정보표기

Index(['c1', 'v1', 'v2'], dtype='object')

In [14]:
df2['v1']

r0    0
r1    1
r2    2
r3    3
r4    4
Name: v1, dtype: int32

In [15]:
df2[['v1','v2']]

    v1        v2
r0   0  0.511970
r1   1  0.975210
r2   2  0.518890
r3   3  0.323018
r4   4  0.483577

In [16]:
df2

   c1  v1        v2
r0  a   0  0.511970
r1  a   1  0.975210
r2  b   2  0.518890
r3  b   3  0.323018
r4  c   4  0.483577

In [17]:
df2=pd.DataFrame({'c1':['a','a','b','b','c'],
                 'v1':np.arange(5),
                 'v2':np.random.rand(5)
                 },
                index=['r0','r1','r2','r3','r4']
                )
df2

   c1  v1        v2
r0  a   0  0.870255
r1  a   1  0.863048
r2  b   2  0.106327
r3  b   3  0.256934
r4  c   4  0.415487

In [18]:
df2=pd.DataFrame({'c1':['a','a','b','b','c'],
                 'v1':np.arange(5),
                 'v2':np.random.randn(5)
                 },
                index=['r0','r1','r2','r3','r4']
                )
df2

   c1  v1        v2
r0  a   0 -0.688443
r1  a   1  0.067763
r2  b   2 -0.219259
r3  b   3 -1.485952
r4  c   4 -0.670318

In [46]:
newindex=['r0','r1','r2','r5','r6']
df2=df2.reindex(newindex, fill_value='NA')
df2
# 중복되는곳은 그대로, 
# 바뀐 곳은 새로운 값으로 대치

    c1
r0  NA
r1  NA
r2  NA
r5  NA
r6  NA

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, r0 to r6
Data columns (total 3 columns):
c1    5 non-null object
v1    5 non-null object
v2    5 non-null object
dtypes: object(3)
memory usage: 160.0+ bytes

In [47]:
dindex=pd.date_range('07/02/2019', periods=5, freq='D')
dindex

DatetimeIndex(['2019-07-02', '2019-07-03', '2019-07-04', '2019-07-05',
               '2019-07-06'],
              dtype='datetime64[ns]', freq='D')

In [48]:
df2=pd.DataFrame({'c1':[1,2,3,4,5]}, index=dindex)

In [43]:
df2

            c1
2019-07-02   1
2019-07-03   2
2019-07-04   3
2019-07-05   4
2019-07-06   5

In [49]:
dindex2=pd.date_range('06/30/2019', periods=10, freq='D')
dindex2

DatetimeIndex(['2019-06-30', '2019-07-01', '2019-07-02', '2019-07-03',
               '2019-07-04', '2019-07-05', '2019-07-06', '2019-07-07',
               '2019-07-08', '2019-07-09'],
              dtype='datetime64[ns]', freq='D')

In [45]:
df2=df2.reindex(dindex2, method='ffill')
df2

             c1
2019-06-30  NaN
2019-07-01  NaN
2019-07-02  1.0
2019-07-03  2.0
2019-07-04  3.0
2019-07-05  4.0
2019-07-06  5.0
2019-07-07  5.0
2019-07-08  5.0
2019-07-09  5.0

In [50]:
df2=df2.reindex(dindex2,method='bfill')
df2

             c1
2019-06-30  1.0
2019-07-01  1.0
2019-07-02  1.0
2019-07-03  2.0
2019-07-04  3.0
2019-07-05  4.0
2019-07-06  5.0
2019-07-07  NaN
2019-07-08  NaN
2019-07-09  NaN